Revit 2026 API

# StoneBumpType Enumeration

---

The enumerated type representing the permitted values for the asset property "StoneBump" from the "Stone" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StoneBumpType
```
```vb
Public Enumeration StoneBumpType
```
```cpp
public enum class StoneBumpType
```
```fsharp
type StoneBumpType
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 4 |  |
| Glossymarble | 3 |  |
| None | 0 |  |
| Polishedgranite | 1 |  |
| Stonewall | 2 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace